app/Views/tmplt/bengkel/dataregisthsv_view.php

SELECT *
FROM `data_user`
---

                                                                                $session = session();
                                                                                $session_data = $session->get('bengkel');
                                        $r = (new DatauserModel())->findAll();

SELECT *
FROM `data_user`
---

                                            $session = session();
                                    $session_data = $session->get('bengkel');
                                        $r = (new DatauserModel())->findAll();

SELECT *
FROM `data_registrasi`
---



                                        $r = (new DataregistrasiModel())->findAll();