app/Views/tmplt/bengkel/datareservhsv_view.php

SELECT *
FROM `data_user`
---

                                                                                use App\Models\LayananModel;

                                        $r = (new DatauserModel())->findAll();

SELECT *
FROM `data_registrasi`
---



                                        $r = (new DataregistrasiModel())->findAll();

SELECT *
FROM `layanan`
---



                                        $r = (new BengkelLayananModel())->findAll();