app/Controllers/bengkel/BengkelRegistHSVController.php

INSERT INTO `data_registrasi` (`data_user_id`, `nama_bengkel`, `alamat_bengkel`, `hp_bengkel`, `status`) VALUES ('4', 'Bengkel Akiong 2', 'JL DESKAP', '08080808', '1')
---
    public function store(){
        $session = session();
        $session_data = $session->get('bengkel');
        $dtu = new BengkelregistrasiModel();



        $status = '2'; // set status default menjadi pending
        if ($this->request->getVar('status')) {
            $status = '1';
        }

        $id =  $dtu->insert([
            'data_user_id' => $session_data['id'],
            'nama_bengkel' => $this->request->getVar('nama_bengkel'),
            'alamat_bengkel' => $this->request->getVar('alamat_bengkel'),
            'hp_bengkel' => $this->request->getVar('hp_bengkel'),
            'status' => $status,
        ]);

DELETE FROM `data_registrasi`
WHERE `id` IN ('11')
---
    public function delete(){
        $dtu = new BengkelregistrasiModel();
        $id = $this->request->getVar('id');
        $hasil = $dtu->delete($id);