app/Controllers/bengkel/BengkelReservhsController.php

SELECT *
FROM `data_user`
---
    public function index()
    {

    return view('tmplt/bengkel/datareservhsv_view',[
        'nama' => (new DatauserModel())->findAll()
        ]);