app/Controllers/DatauserController.php

public function login() {
    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password');
    $level = $this->request->getPost('level');


    $user = (new DatauserModel())->where('username', $username)->first();
---
SELECT *
FROM `data_user`
WHERE `username` = 'bengkel2'
 LIMIT 1